:PROPERTIES:
:ID: FB4F43FF-90FF-4E67-8BD0-C6DB47DD6E69
:END:
#+title: Get
#+description: Get
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:change_reasons:
#+created: 2026-05-21
#+updated: 2026-05-21

Get all change reasons in the system.

#+name: change-reasons-get
#+begin_src ores-shell :exports none
change-reasons get
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<change-reasons-get>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell>
+-----------------------------+----------+----------------------------------------------------+-------+--------+--------------+-------+-------------+---------+
| Code                        | Category | Description                                        | Amend | Delete | Req. Comment | Order | Recorded By | Version |
+-----------------------------+----------+----------------------------------------------------+-------+--------+--------------+-------+-------------+---------+
| system.initial_load         | system   | Initial system bootstrap or migration              | N     | N      | N            | 0     | system      | 1       |
| common.non_material_update  | common   | Non-material update (Touch)                        | Y     | N      | N            | 10    | system      | 1       |
| system.new_record           | system   | New record created during normal operations        | N     | N      | N            | 10    | system      | 1       |
| trade.fat_finger            | trade    | Erroneous execution (wrong quantity/price)         | Y     | Y      | N            | 10    | system      | 1       |
| common.rectification        | common   | User/Booking Error                                 | Y     | Y      | N            | 20    | system      | 1       |
| system.external_data_import | system   | External data import (requires data lineage)       | Y     | N      | Y            | 20    | system      | 1       |
| trade.system_malfunction    | trade    | Technical glitch or algorithm issue 2              | Y     | Y      | Y            | 20    | newuser3    | 4       |
| common.duplicate            | common   | Duplicate Record                                   | N     | Y      | N            | 30    | system      | 1       |
| trade.corporate_action      | trade    | Stock split, dividend, or merger adjustment        | Y     | Y      | N            | 30    | system      | 1       |
| common.stale_data           | common   | Data not updated within required liquidity horizon | Y     | Y      | N            | 40    | system      | 1       |
| trade.allocation_swap       | trade    | House to client sub-account reallocation           | Y     | Y      | N            | 40    | system      | 1       |
| common.outlier_correction   | common   | Manual override after plausibility check failure   | Y     | Y      | Y            | 50    | system      | 1       |
| trade.re_booking            | trade    | Wrong legal entity correction                      | Y     | Y      | Y            | 50    | system      | 1       |
| common.feed_failure         | common   | Upstream vendor/API data issue                     | Y     | Y      | Y            | 60    | system      | 1       |
| common.mapping_error        | common   | Incorrect ID translation (e.g., ISIN to FIGI)      | Y     | Y      | Y            | 70    | system      | 1       |
| common.judgmental_override  | common   | Expert judgment when market prices unavailable     | Y     | Y      | Y            | 80    | system      | 1       |
| common.regulatory           | common   | Mandatory compliance adjustment                    | Y     | Y      | Y            | 90    | system      | 1       |
| trade.other                 | trade    | Exceptional (requires audit note)                  | N     | Y      | Y            | 999   | newuser3    | 2       |
| common.other                | common   | Exceptional (requires audit note)                  | Y     | Y      | Y            | 1000  | system      | 1       |
+-----------------------------+----------+----------------------------------------------------+-------+--------+--------------+-------+-------------+---------+


ores-shell> Bye!
#+end_example
